Revit 2027 API
Element.Parameter(Definition) Property
Retrieves a parameter from the element based on its definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Parameter this[
	Definition definition
] { get; }
Public ReadOnly Property Parameter (
	definition As Definition
) As Parameter
	Get
public:
property Parameter^ Parameter[Definition^ definition] {
	Parameter^ get (Definition^ definition);
}
member Parameter : Parameter with get
Parameters
definition Definition
The internal or external definition of the parameter.
Property Value
Parameter
Remarks
Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. An element can only have one instance of a parameter with a specific definition. By using this method you can retrieve that parameter based on definition.
See Also
Reference
Element Class
Parameter Overload
Autodesk.Revit.DB Namespace